{
    "backend": "tensorflow",
    "batch_size": 128,
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ],
                    "dtype": "float32",
                    "name": "input",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_9",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_9"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_9",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_9"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_10",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_10"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_10",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_10"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "name": "max_pooling2d_5",
                    "padding": "valid",
                    "pool_size": [
                        2,
                        2
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_5"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_5",
                    "noise_shape": null,
                    "rate": 0.25,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_5"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_11",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_11"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_11",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_11"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_12",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_12"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_12",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_12",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_12"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "name": "max_pooling2d_6",
                    "padding": "valid",
                    "pool_size": [
                        2,
                        2
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_12",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_6"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_6",
                    "noise_shape": null,
                    "rate": 0.25,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_6"
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten_3",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "flatten_3"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_5",
                    "trainable": true,
                    "units": 512,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "flatten_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_5"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "softmax",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_6",
                    "trainable": true,
                    "units": 10,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_6"
            }
        ],
        "name": "CNN",
        "output_layers": [
            [
                "dense_6",
                0,
                0
            ]
        ]
    },
    "experiment_name": "Eve",
    "img_dim": [
        32,
        32,
        3
    ],
    "keras_version": "2.1.4",
    "nb_epoch": 200,
    "optimizer": {
        "beta_1": 0.8999999761581421,
        "beta_2": 0.9990000128746033,
        "beta_3": 0.9990000128746033,
        "big_K": 10.0,
        "epsilon": 1e-08,
        "lr": 9.999999747378752e-05,
        "small_k": 0.10000000149011612
    },
    "train_accs": [
        [
            0.1000200000011921
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000238418
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999761582
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.10000000000953674
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1000000000011921
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000476837
        ],
        [
            0.1000000000011921
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.09999999999523163
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999761582
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000476837
        ],
        [
            0.09999999999761582
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999523163
        ],
        [
            0.1000000000011921
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000238418
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.09999999999761582
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999046326
        ],
        [
            0.09999999999523163
        ],
        [
            0.09999999999523163
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000953674
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.10000000000476837
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999761582
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000238418
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999761582
        ],
        [
            0.1
        ],
        [
            0.09999999999761582
        ],
        [
            0.10000000000953674
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.09999999999046326
        ],
        [
            0.1
        ],
        [
            0.10000000000953674
        ],
        [
            0.09999999999761582
        ],
        [
            0.09999999999523163
        ],
        [
            0.1000000000011921
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000476837
        ],
        [
            0.09999999999761582
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000238418
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999523163
        ],
        [
            0.09999999999761582
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000238418
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999523163
        ],
        [
            0.1
        ],
        [
            0.10000000000476837
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000953674
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.10000000000476837
        ],
        [
            0.1000000000011921
        ],
        [
            0.09999999999761582
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999523163
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.09999999999046326
        ],
        [
            0.09999999999761582
        ],
        [
            0.09999999999761582
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000476837
        ],
        [
            0.09999999999523163
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000238418
        ],
        [
            0.1
        ],
        [
            0.09999999999761582
        ],
        [
            0.09999999999523163
        ],
        [
            0.1
        ],
        [
            0.09999999999761582
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000953674
        ],
        [
            0.1000000000011921
        ],
        [
            0.1000000000011921
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000476837
        ],
        [
            0.1000000000011921
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000476837
        ],
        [
            0.10000000000059604
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.09999999999761582
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000953674
        ],
        [
            0.10000000000476837
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000953674
        ],
        [
            0.1
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000953674
        ],
        [
            0.1
        ],
        [
            0.09999999999761582
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999761582
        ],
        [
            0.10000000000953674
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000238418
        ],
        [
            0.09999999999523163
        ],
        [
            0.10000000000953674
        ],
        [
            0.09999999999046326
        ],
        [
            0.1000000000011921
        ],
        [
            0.09999999999046326
        ],
        [
            0.1000000000011921
        ],
        [
            0.1
        ],
        [
            0.10000000000476837
        ],
        [
            0.1
        ],
        [
            0.10000000000953674
        ],
        [
            0.10000000000238418
        ],
        [
            0.10000000000238418
        ]
    ],
    "train_losses": [
        [
            0.005907504768385756
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ]
    ],
    "val_accs": [
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ],
        [
            0.1
        ]
    ],
    "val_losses": [
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
            1.1920930376163597e-07
        ],
        [
