{
    "backend": "tensorflow",
    "batch_size": 4096,
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ],
                    "dtype": "float32",
                    "name": "input",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_1",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_2",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_2"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "name": "max_pooling2d_1",
                    "padding": "valid",
                    "pool_size": [
                        2,
                        2
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_1"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "noise_shape": null,
                    "rate": 0.25,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_3",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_3"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_3",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_3"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_4",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_4"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_4",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_4"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "name": "max_pooling2d_2",
                    "padding": "valid",
                    "pool_size": [
                        2,
                        2
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_2"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_2",
                    "noise_shape": null,
                    "rate": 0.25,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_2"
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "flatten_1"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_1",
                    "trainable": true,
                    "units": 512,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "flatten_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_1"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "softmax",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_2",
                    "trainable": true,
                    "units": 100,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_2"
            }
        ],
        "name": "CNN",
        "output_layers": [
            [
                "dense_2",
                0,
                0
            ]
        ]
    },
    "experiment_name": "Adam",
    "img_dim": [
        32,
        32,
        3
    ],
    "keras_version": "2.1.4",
    "nb_epoch": 200,
    "optimizer": {
        "amsgrad": false,
        "beta_1": 0.8999999761581421,
        "beta_2": 0.9990000128746033,
        "decay": 9.999999747378752e-05,
        "epsilon": 1e-08,
        "lr": 9.999999747378752e-05
    },
    "train_accs": [
        [
            0.012140000002682208
        ],
        [
            0.01910000000655651
        ],
        [
            0.02661999999284744
        ],
        [
            0.04302000001192093
        ],
        [
            0.057600000033378604
        ],
        [
            0.07415999997138976
        ],
        [
            0.08849999998807907
        ],
        [
            0.10139999989032746
        ],
        [
            0.11345999995231629
        ],
        [
            0.12545999999046326
        ],
        [
            0.13638000003814696
        ],
        [
            0.14601999992847442
        ],
        [
            0.15805999988555908
        ],
        [
            0.16516000001430511
        ],
        [
            0.17214000012397765
        ],
        [
            0.18013999999046326
        ],
        [
            0.18782000012397765
        ],
        [
            0.19299999990940095
        ],
        [
            0.19526000006198882
        ],
        [
            0.20157999989032746
        ],
        [
            0.20724000004768373
        ],
        [
            0.21518000006198884
        ],
        [
            0.2159000001001358
        ],
        [
            0.21892000000476838
        ],
        [
            0.2271799998807907
        ],
        [
            0.23052000006198883
        ],
        [
            0.23213999987602235
        ],
        [
            0.23843999990463258
        ],
        [
            0.2384
        ],
        [
            0.24488000009536742
        ],
        [
            0.24688000012397765
        ],
        [
            0.24857999993324278
        ],
        [
            0.2545000001335144
        ],
        [
            0.25610000019073487
        ],
        [
            0.25930000000953674
        ],
        [
            0.2649399998474121
        ],
        [
            0.26679999992370607
        ],
        [
            0.2701600000619888
        ],
        [
            0.2733800000190735
        ],
        [
            0.27805999975204465
        ],
        [
            0.2811200000667572
        ],
        [
            0.28443999989509583
        ],
        [
            0.28465999977111817
        ],
        [
            0.29151999976158144
        ],
        [
            0.29247999977111816
        ],
        [
            0.2973799998855591
        ],
        [
            0.2978800002002716
        ],
        [
            0.30418000002861023
        ],
        [
            0.30717999976158145
        ],
        [
            0.30940000002861023
        ],
        [
            0.31037999997138976
        ],
        [
            0.31451999985694884
        ],
        [
            0.31769999975204466
        ],
        [
            0.3220200000858307
        ],
        [
            0.3248399997997284
        ],
        [
            0.3282199998950958
        ],
        [
            0.3283200001811981
        ],
        [
            0.3326000001525879
        ],
        [
            0.33424000011444094
        ],
        [
            0.3373600002002716
        ],
        [
            0.3408399998664856
        ],
        [
            0.3454000000858307
        ],
        [
            0.34642000023841857
        ],
        [
            0.3497200000476837
        ],
        [
            0.35321999997138975
        ],
        [
            0.35430000002861023
        ],
        [
            0.3552999998950958
        ],
        [
            0.35570000018119813
        ],
        [
            0.3629600002002716
        ],
        [
            0.3652400002002716
        ],
        [
            0.36337999992370607
        ],
        [
            0.37117999995231626
        ],
        [
            0.37184000012397767
        ],
        [
            0.3728599999523163
        ],
        [
            0.3759999998474121
        ],
        [
            0.38294000001907347
        ],
        [
            0.38169999990463255
        ],
        [
            0.38379999992370606
        ],
        [
            0.3861800001335144
        ],
        [
            0.38962000019073484
        ],
        [
            0.38899999991416934
        ],
        [
            0.3939000000858307
        ],
        [
            0.3949400000190735
        ],
        [
            0.3990999997997284
        ],
        [
            0.3990000002002716
        ],
        [
            0.4011799997997284
        ],
        [
            0.40362000015258787
        ],
        [
            0.4082000000476837
        ],
        [
            0.40905999981880187
        ],
        [
            0.4093200001525879
        ],
        [
            0.41273999983787535
        ],
        [
            0.41748000010490416
        ],
        [
            0.4185999998474121
        ],
        [
            0.4211000002479553
        ],
        [
            0.4221799998092651
        ],
        [
            0.4240000000286102
        ],
        [
            0.42848000010490417
        ],
        [
            0.4268399998188019
        ],
        [
            0.433119999961853
        ],
        [
            0.43158000007629393
        ],
        [
            0.4352000000667572
        ],
        [
            0.4380800002384186
        ],
        [
            0.43710000007629396
        ],
        [
            0.4405400000286102
        ],
        [
            0.4434200001716614
        ],
        [
            0.44447999994277954
        ],
        [
            0.4489199998664856
        ],
        [
            0.4523799998950958
        ],
        [
            0.4504800001811981
        ],
        [
            0.45519999987602233
        ],
        [
            0.45479999997138976
        ],
        [
            0.4602600002479553
        ],
        [
            0.4588600001525879
        ],
        [
            0.46083999977111817
        ],
        [
            0.46532000009536745
        ],
        [
            0.46709999987602235
        ],
        [
            0.4674599999141693
        ],
        [
            0.4686999997520447
        ],
        [
            0.4722
        ],
        [
            0.4742999998950958
        ],
        [
            0.47523999983787535
        ],
        [
            0.4805800002002716
        ],
        [
            0.48073999979972837
        ],
        [
            0.48441999995231627
        ],
        [
            0.4834199999332428
        ],
        [
            0.48357999983787536
        ],
        [
            0.48607999980926514
        ],
        [
            0.49255999990463256
        ],
        [
            0.4902400002861023
        ],
        [
            0.4944200001525879
        ],
        [
            0.4985600004768372
        ],
        [
            0.4989199999809265
        ],
        [
            0.49922000007629397
        ],
        [
            0.5018200000858307
        ],
        [
            0.5012799996376037
        ],
        [
            0.5019800000190735
        ],
        [
            0.5085799997615814
        ],
        [
            0.5121799998378753
        ],
        [
            0.5110999998569489
        ],
        [
            0.5118999999809265
        ],
        [
            0.5155800002861023
        ],
        [
            0.5146599998283387
        ],
        [
            0.5183000000953675
        ],
        [
            0.5202599998283386
        ],
        [
            0.5241999995613098
        ],
        [
            0.5233199999046325
        ],
        [
            0.525940000038147
        ],
        [
            0.5271599995422364
        ],
        [
            0.5300200001239777
        ],
        [
            0.5323800000953675
        ],
        [
            0.5335399997138977
        ],
        [
            0.5342800001716613
        ],
        [
            0.5413200002098083
        ],
        [
            0.5390400000572204
        ],
        [
            0.5409800004577636
        ],
        [
            0.5410800001716614
        ],
        [
            0.543960000076294
        ],
        [
            0.5448799995613098
        ],
        [
            0.5489200001525879
        ],
        [
            0.5517200000381469
        ],
        [
            0.5538800002861023
        ],
        [
            0.5541999995613098
        ],
        [
            0.5536799997329712
        ],
        [
            0.5581000000762939
        ],
        [
            0.5606199996376038
        ],
        [
            0.561559999885559
        ],
        [
            0.5627199996566773
        ],
        [
            0.5631400002861023
        ],
        [
            0.5660199998474121
        ],
        [
            0.5672600000190735
        ],
        [
            0.5705999997138977
        ],
        [
            0.5703600003433228
        ],
        [
            0.5717199998283387
        ],
        [
            0.5763200002098083
        ],
        [
            0.579279999923706
        ],
        [
            0.5786599997329712
        ],
        [
            0.5807399995422363
        ],
        [
            0.5845000002288818
        ],
        [
            0.5834000003433227
        ],
        [
            0.5877199995994568
        ],
        [
            0.5907800000762939
        ],
        [
            0.5909200004959106
        ],
        [
            0.5921000001335144
        ],
        [
            0.5962399995231629
        ],
        [
            0.5950199999427795
        ],
        [
            0.5979400004196167
        ],
        [
            0.5972599999809265
        ],
        [
            0.6006200004386902
        ],
        [
            0.6026799997901916
        ],
        [
            0.6052800000572205
        ],
        [
            0.6067600001716614
        ],
        [
            0.607519999961853
        ],
        [
            0.6091200000953675
        ],
        [
            0.6108000000572205
        ],
        [
            0.6110999995803833
        ],
        [
            0.6133999998092652
        ],
        [
            0.6135199995994568
        ],
        [
            0.6205599996948242
        ],
        [
            0.6187799999046326
        ],
        [
            0.6215
        ]
    ],
    "train_losses": [
        [
            4.60259596786499
        ],
        [
            4.578951667633056
        ],
        [
            4.52900902557373
        ],
        [
            4.415839143676758
        ],
        [
            4.273486110992431
        ],
        [
            4.151388146820068
        ],
        [
            4.0531032398986815
        ],
        [
            3.9755268256378176
        ],
        [
            3.90617557510376
        ],
        [
            3.835406085891724
        ],
        [
            3.7714094709777832
        ],
        [
            3.7114093129730223
        ],
        [
            3.6604140801239016
        ],
        [
            3.6150861618804933
        ],
        [
            3.5742127543640136
        ],
        [
            3.5334008974456785
        ],
        [
            3.493739946899414
        ],
        [
            3.4645907666015625
        ],
        [
            3.4337802085876463
        ],
        [
            3.4056221083831786
        ],
        [
            3.3795456699371336
        ],
        [
            3.3528233500671387
        ],
        [
            3.3352324998474123
        ],
        [
            3.308405113220215
        ],
        [
            3.278876009902954
        ],
        [
            3.259613404388428
        ],
        [
            3.2417807160949708
        ],
        [
            3.2185469010162353
        ],
        [
            3.199500718154907
        ],
        [
            3.1763647230529783
        ],
        [
            3.1562588804626466
        ],
        [
            3.143620079650879
        ],
        [
            3.1236472077178954
        ],
        [
            3.101727423629761
        ],
        [
            3.0844070737457274
        ],
        [
            3.0649744618988035
        ],
        [
            3.0477251288604736
        ],
        [
            3.0303245809936525
        ],
        [
            3.0111748496246338
        ],
        [
            2.9940339614105222
        ],
        [
            2.978931709060669
        ],
        [
            2.963648599472046
        ],
        [
            2.9491621579742433
        ],
        [
            2.9272636752319334
        ],
        [
            2.9127278896331785
        ],
        [
            2.895652689743042
        ],
        [
            2.882397576751709
        ],
        [
            2.859235306854248
        ],
        [
            2.8456646640777588
        ],
        [
            2.830945449523926
        ],
        [
            2.815173843383789
        ],
        [
            2.7966705631256104
        ],
        [
            2.7844192980194094
        ],
        [
            2.7657821815490724
        ],
        [
            2.7529213150787353
        ],
        [
            2.74147964012146
        ],
        [
            2.723288582611084
        ],
        [
            2.7089844371032714
        ],
        [
            2.6955264601135256
        ],
        [
            2.6821518907165527
        ],
        [
            2.6689389017486573
        ],
        [
            2.6511181187438964
        ],
        [
            2.6410992057037355
        ],
        [
            2.6242881465148926
        ],
        [
            2.611132811508179
        ],
        [
            2.599622521286011
        ],
        [
            2.5850366328430177
        ],
        [
            2.575746455154419
        ],
        [
            2.563848971481323
        ],
        [
            2.5464860162353515
        ],
        [
            2.5403283416748046
        ],
        [
            2.5226152361297607
        ],
        [
            2.513353437347412
        ],
        [
            2.5017491732788084
        ],
        [
            2.4891741793060302
        ],
        [
            2.4706038272094726
        ],
        [
            2.465678935852051
        ],
        [
            2.459495389175415
        ],
        [
            2.4431366606140137
        ],
        [
            2.4273130142211916
        ],
        [
            2.4170368601989747
        ],
        [
            2.4069101694488526
        ],
        [
            2.3954698280334474
        ],
        [
            2.37792625
        ],
        [
            2.376693694458008
        ],
        [
            2.3653982765197754
        ],
        [
            2.3544272073364256
        ],
        [
            2.3423022815704346
        ],
        [
            2.331678856277466
        ],
        [
            2.3264201259613038
        ],
        [
            2.31652770652771
        ],
        [
            2.299356568069458
        ],
        [
            2.2891786604309083
        ],
        [
            2.281440150756836
        ],
        [
            2.2685616159057616
        ],
        [
            2.2602708451843263
        ],
        [
            2.247557254486084
        ],
        [
            2.2424468270874023
        ],
        [
            2.232682520980835
        ],
        [
            2.2214619047546385
        ],
        [
            2.2086832695007326
        ],
        [
            2.198018099975586
        ],
        [
            2.192294896697998
        ],
        [
            2.185358477783203
        ],
        [
            2.1685099588775634
        ],
        [
            2.1616501690673826
        ],
        [
            2.147492168426514
        ],
        [
            2.141898429107666
        ],
        [
            2.1334419734191896
        ],
        [
            2.1238415254211427
        ],
        [
            2.114089991836548
        ],
        [
            2.1012895202636717
        ],
        [
            2.0985542472076415
        ],
        [
            2.0889002211761474
        ],
        [
            2.078421141204834
        ],
        [
            2.0623880164337156
        ],
        [
            2.0591985053253175
        ],
        [
            2.050621814727783
        ],
        [
            2.0432827653884886
        ],
        [
            2.029908132858276
        ],
        [
            2.016521279602051
        ],
        [
            2.0098730107879637
        ],
        [
            2.0046100142669676
        ],
        [
            1.9881466868591309
        ],
        [
            1.9866440518569946
        ],
        [
            1.9787752130508423
        ],
        [
            1.9700767455291748
        ],
        [
            1.9546600535202026
        ],
        [
            1.9556644564819337
        ],
        [
            1.9367328508758546
        ],
        [
            1.92491294090271
        ],
        [
            1.9205225123596192
        ],
        [
            1.9126630532455444
        ],
        [
            1.9023032704925538
        ],
        [
            1.8982463283538817
        ],
        [
            1.891951704788208
        ],
        [
            1.8815960499191284
        ],
        [
            1.8647855099105834
        ],
        [
            1.8611912992858888
        ],
        [
            1.8565571784210204
        ],
        [
            1.8443286532211303
        ],
        [
            1.8366576314163208
        ],
        [
            1.826845662574768
        ],
        [
            1.8135901691818237
        ],
        [
            1.8077835065078736
        ],
        [
            1.8041943115234376
        ],
        [
            1.7959095072937012
        ],
        [
            1.786591210975647
        ],
        [
            1.7806228371047974
        ],
        [
            1.7683231535339357
        ],
        [
            1.7560621656799316
        ],
        [
            1.7531504860305787
        ],
        [
            1.7393054021072387
        ],
        [
            1.7347598478698731
        ],
        [
            1.7255787408447265
        ],
        [
            1.7240534482192993
        ],
        [
            1.71353951007843
        ],
        [
            1.7050604435729981
        ],
        [
            1.6992969428253173
        ],
        [
            1.687636004257202
        ],
        [
            1.670097201538086
        ],
        [
            1.6675027179718018
        ],
        [
            1.66699500415802
        ],
        [
            1.6532017775726318
        ],
        [
            1.6420545995712281
        ],
        [
            1.6378072265625
        ],
        [
            1.629852865638733
        ],
        [
            1.6245408472442626
        ],
        [
            1.6121418653869628
        ],
        [
            1.60656137134552
        ],
        [
            1.5952964126586915
        ],
        [
            1.5922460823440552
        ],
        [
            1.5883989312362672
        ],
        [
            1.571153547668457
        ],
        [
            1.5590070595932006
        ],
        [
            1.5570832176208496
        ],
        [
            1.5515404927444458
        ],
        [
            1.5425955516433716
        ],
        [
            1.5419743427658081
        ],
        [
            1.5236401107406616
        ],
        [
            1.5169875980758667
        ],
        [
            1.5103788471221924
        ],
        [
            1.5051619221878052
        ],
        [
            1.4916481185531616
        ],
        [
            1.4916251858520508
        ],
        [
            1.484327445487976
        ],
        [
            1.4763116920089723
        ],
        [
            1.4663099432754516
        ],
        [
            1.4618985647964478
        ],
        [
            1.4492611965560913
        ],
        [
            1.446392250328064
        ],
        [
            1.4400921159362794
        ],
        [
            1.4352176887893677
        ],
        [
            1.4169976636505126
        ],
        [
            1.4164160531234742
        ],
        [
            1.4058994134140015
        ],
        [
            1.4077945148086548
        ],
        [
            1.3901053956985474
        ],
        [
            1.3862417658996582
        ],
        [
            1.376471286201477
        ]
    ],
    "val_accs": [
        [
            0.012299999950826168
        ],
        [
            0.01719999998807907
        ],
        [
            0.040200000226497654
        ],
        [
            0.06089999970793724
        ],
        [
            0.07319999940395355
        ],
        [
            0.08630000002384186
        ],
        [
            0.09640000060796737
        ],
        [
            0.11290000013113022
        ],
        [
            0.11490000038146973
        ],
        [
            0.13239999918937684
        ],
        [
            0.14419999876022338
        ],
        [
            0.15070000052452087
        ],
        [
            0.1601999993801117
        ],
        [
            0.17280000092983247
        ],
        [
            0.18150000109672546
        ],
        [
            0.18490000126361847
        ],
        [
            0.19349999868869783
        ],
        [
            0.19680000116825103
        ],
        [
            0.20119999952316284
        ],
        [
            0.20599999902248384
        ],
        [
            0.21319999947547913
        ],
        [
            0.2158999992609024
        ],
        [
            0.2181000012397766
        ],
        [
            0.2250999993801117
        ],
        [
            0.22209999921321869
        ],
        [
            0.2283999995470047
        ],
        [
            0.23530000021457673
        ],
        [
            0.23539999895095826
        ],
        [
            0.24339999747276306
        ],
        [
            0.24710000071525573
        ],
        [
            0.24499999928474425
        ],
        [
            0.2507000002861023
        ],
        [
            0.25490000028610227
        ],
        [
            0.25450000104904175
        ],
        [
            0.2604999999046326
        ],
        [
            0.2620999980926514
        ],
        [
            0.264900001335144
        ],
        [
            0.2735999976634979
        ],
        [
            0.27029999842643737
        ],
        [
            0.27569999804496764
        ],
        [
            0.2802000012397766
        ],
        [
            0.2754000009059906
        ],
        [
            0.2838000011920929
        ],
        [
            0.2849000015735626
        ],
        [
            0.28699999938011167
        ],
        [
            0.28900000190734865
        ],
        [
            0.291099998998642
        ],
        [
            0.2938999979019165
        ],
        [
            0.2965999979019165
        ],
        [
            0.2951000018596649
        ],
        [
            0.3019999985694885
        ],
        [
            0.30099999895095825
        ],
        [
            0.3022000007152557
        ],
        [
            0.3070999985218048
        ],
        [
            0.30619999890327454
        ],
        [
            0.3105999974250793
        ],
        [
            0.3107000024795532
        ],
        [
            0.31510000243186953
        ],
        [
            0.317800001335144
        ],
        [
            0.3185999991893768
        ],
        [
            0.3164999980926514
        ],
        [
            0.3234000012874603
        ],
        [
            0.3198999999046326
        ],
        [
            0.3228999991416931
        ],
        [
            0.32790000233650207
        ],
        [
            0.3280000016212463
        ],
        [
            0.32560000200271605
        ],
        [
            0.32779999766349793
        ],
        [
            0.33240000162124633
        ],
        [
            0.3305000005245209
        ],
        [
            0.3333000008583069
        ],
        [
            0.3355000022888184
        ],
        [
            0.3336000005245209
        ],
        [
            0.3355000022888184
        ],
        [
            0.3402000004768372
        ],
        [
            0.3400999976158142
        ],
        [
            0.3417999990463257
        ],
        [
            0.3409999994277954
        ],
        [
            0.3433000008106232
        ],
        [
            0.3435000000953674
        ],
        [
            0.34440000114440916
        ],
        [
            0.34550000047683715
        ],
        [
            0.3488000021934509
        ],
        [
            0.3500999986171722
        ],
        [
            0.34860000081062315
        ],
        [
            0.35340000038146974
        ],
        [
            0.35139999752044676
        ],
        [
            0.3559000025272369
        ],
        [
            0.35250000224113465
        ],
        [
            0.3563000014781952
        ],
        [
            0.3530000004291534
        ],
        [
            0.3597999989032745
        ],
        [
            0.3590000024795532
        ],
        [
            0.35910000219345095
        ],
        [
            0.3617
        ],
        [
            0.3575
        ],
        [
            0.3611
        ],
        [
            0.36180000104904175
        ],
        [
            0.36330000104904175
        ],
        [
            0.3653999978065491
        ],
        [
            0.36580000104904176
        ],
        [
            0.3677000024795532
        ],
        [
            0.36849999742507933
        ],
        [
            0.36749999814033507
        ],
        [
            0.3674999999523163
        ],
        [
            0.3685999984741211
        ],
        [
            0.3664999999523163
        ],
        [
            0.3702999995708466
        ],
        [
            0.367000000333786
        ],
        [
            0.3685000017166138
        ],
        [
            0.3708999981403351
        ],
        [
            0.3709000017642975
        ],
        [
            0.37089999885559083
        ],
        [
            0.37359999952316286
        ],
        [
            0.37389999737739565
        ],
        [
            0.37510000133514404
        ],
        [
            0.37489999775886534
        ],
        [
            0.3754000020503998
        ],
        [
            0.3757000006198883
        ],
        [
            0.3777000006198883
        ],
        [
            0.3776000009536743
        ],
        [
            0.37660000023841855
        ],
        [
            0.3760999988079071
        ],
        [
            0.3772999973297119
        ],
        [
            0.38000000200271605
        ],
        [
            0.37859999771118164
        ],
        [
            0.3796999977111816
        ],
        [
            0.37969999985694886
        ],
        [
            0.38129999985694885
        ],
        [
            0.38179999804496767
        ],
        [
            0.3823000020027161
        ],
        [
            0.38250000166893006
        ],
        [
            0.38229999809265136
        ],
        [
            0.3860000012874603
        ],
        [
            0.3821999977111816
        ],
        [
            0.3845999994754791
        ],
        [
            0.38540000019073484
        ],
        [
            0.38309999804496764
        ],
        [
            0.3834000009536743
        ],
        [
            0.3862999991416931
        ],
        [
            0.38579999876022336
        ],
        [
            0.3840999984264374
        ],
        [
            0.3866000026702881
        ],
        [
            0.3865999998092651
        ],
        [
            0.38730000128746034
        ],
        [
            0.3891999987125397
        ],
        [
            0.3873999976634979
        ],
        [
            0.3886999987125397
        ],
        [
            0.38989999837875366
        ],
        [
            0.38959999980926513
        ],
        [
            0.3895999976634979
        ],
        [
            0.39220000195503235
        ],
        [
            0.3904999979972839
        ],
        [
            0.3914000012397766
        ],
        [
            0.3933000026702881
        ],
        [
            0.39019999766349794
        ],
        [
            0.39030000195503234
        ],
        [
            0.3901999998092651
        ],
        [
            0.39559999799728396
        ],
        [
            0.38960000200271605
        ],
        [
            0.3906000005245209
        ],
        [
            0.3946000015735626
        ],
        [
            0.39010000233650205
        ],
        [
            0.3900000016212463
        ],
        [
            0.3890000005245209
        ],
        [
            0.3957999987125397
        ],
        [
            0.39230000228881834
        ],
        [
            0.3885000001907349
        ],
        [
            0.3926999998092651
        ],
        [
            0.39089999980926515
        ],
        [
            0.39349999833106997
        ],
        [
            0.3942999994277954
        ],
        [
            0.3943999994277954
        ],
        [
            0.3901999994754791
        ],
        [
            0.39290000014305115
        ],
        [
            0.39360000195503236
        ],
        [
            0.39390000162124633
        ],
        [
            0.39459999799728396
        ],
        [
            0.3946999998092651
        ],
        [
            0.39309999980926513
        ],
        [
            0.3976000012397766
        ],
        [
            0.39490000014305116
        ],
        [
            0.39599999837875366
        ],
        [
            0.39519999942779543
        ],
        [
            0.3944999979972839
        ],
        [
            0.3958000008583069
        ],
        [
            0.3969000005245209
        ],
        [
            0.39479999732971194
        ],
        [
            0.3965999994277954
        ],
        [
            0.3997999990463257
        ],
        [
            0.39720000195503236
        ],
        [
            0.39540000195503233
        ],
        [
            0.40010000228881837
        ],
        [
            0.3987999976158142
        ],
        [
            0.39950000190734863
        ],
        [
            0.39649999837875366
        ],
        [
            0.3966000012397766
        ],
        [
            0.40080000014305117
        ],
        [
            0.40049999761581423
        ],
        [
            0.4008000011920929
        ]
    ],
    "val_losses": [
        [
            4.5930681640625
        ],
        [
            4.5644014465332035
        ],
        [
            4.4751259735107425
        ],
        [
            4.317163558197022
        ],
        [
            4.181291581726074
        ],
        [
            4.080032091522217
        ],
        [
            4.01146075592041
        ],
        [
            3.9250477245330813
        ],
        [
            3.879972918319702
        ],
        [
            3.808124993133545
        ],
        [
            3.739489825820923
        ],
        [
            3.6873129695892333
        ],
        [
            3.6434533748626707
        ],
        [
            3.5950629055023193
        ],
        [
            3.557171484375
        ],
        [
            3.5174201171875
        ],
        [
