{
    "backend": "tensorflow",
    "batch_size": 128,
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ],
                    "dtype": "float32",
                    "name": "input",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_1",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_2",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_2"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "name": "max_pooling2d_1",
                    "padding": "valid",
                    "pool_size": [
                        2,
                        2
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_1"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "noise_shape": null,
                    "rate": 0.25,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_1"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_3",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_3"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_3",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_3"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": {
                        "class_name": "L1L2",
                        "config": {
                            "l1": 0.0,
                            "l2": 0.0
                        }
                    },
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_4",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_4"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "name": "activation_4",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_4"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "name": "max_pooling2d_2",
                    "padding": "valid",
                    "pool_size": [
                        2,
                        2
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_2"
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_2",
                    "noise_shape": null,
                    "rate": 0.25,
                    "seed": null,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dropout_2"
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dropout_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "flatten_1"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_1",
                    "trainable": true,
                    "units": 512,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "flatten_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_1"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "softmax",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_2",
                    "trainable": true,
                    "units": 10,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_2"
            }
        ],
        "name": "CNN",
        "output_layers": [
            [
                "dense_2",
                0,
                0
            ]
        ]
    },
    "experiment_name": "SGD",
    "img_dim": [
        32,
        32,
        3
    ],
    "keras_version": "2.1.4",
    "nb_epoch": 200,
    "optimizer": {
        "decay": 9.999999747378752e-05,
        "lr": 0.009999999776482582,
        "momentum": 0.8999999761581421,
        "nesterov": true
    },
    "train_accs": [
        [
            0.32625999998092653
        ],
        [
            0.5154000000190735
        ],
        [
            0.59982
        ],
        [
            0.65294
        ],
        [
            0.6914399999809265
        ],
        [
            0.725060000038147
        ],
        [
            0.751639999961853
        ],
        [
            0.77252
        ],
        [
            0.79624
        ],
        [
            0.8166200000381469
        ],
        [
            0.837640000038147
        ],
        [
            0.8526
        ],
        [
            0.86996
        ],
        [
            0.8855999999809265
        ],
        [
            0.9005600000190734
        ],
        [
            0.912120000038147
        ],
        [
            0.922719999961853
        ],
        [
            0.9321800000381469
        ],
        [
            0.939540000038147
        ],
        [
            0.94576
        ],
        [
            0.9534799999809265
        ],
        [
            0.9559399999809265
        ],
        [
            0.96014
        ],
        [
            0.9637999999618531
        ],
        [
            0.966680000038147
        ],
        [
            0.971419999961853
        ],
        [
            0.9717200000190734
        ],
        [
            0.9750200000381469
        ],
        [
            0.977940000038147
        ],
        [
            0.9766800000190735
        ],
        [
            0.98044
        ],
        [
            0.981039999961853
        ],
        [
            0.9820400000190734
        ],
        [
            0.98228
        ],
        [
            0.983660000038147
        ],
        [
            0.98628
        ],
        [
            0.9863
        ],
        [
            0.98702
        ],
        [
            0.98644
        ],
        [
            0.9878999999618531
        ],
        [
            0.9896200000190735
        ],
        [
            0.98854
        ],
        [
            0.98902
        ],
        [
            0.99058
        ],
        [
            0.9910200000190735
        ],
        [
            0.9911
        ],
        [
            0.9913400000190735
        ],
        [
            0.992
        ],
        [
            0.991940000038147
        ],
        [
            0.991740000038147
        ],
        [
            0.9923800000190734
        ],
        [
            0.99168
        ],
        [
            0.99292
        ],
        [
            0.99376
        ],
        [
            0.99328
        ],
        [
            0.9932600000190734
        ],
        [
            0.9936
        ],
        [
            0.9939400000190735
        ],
        [
            0.9937800000190735
        ],
        [
            0.9939600000190735
        ],
        [
            0.99448
        ],
        [
            0.99504
        ],
        [
            0.9946
        ],
        [
            0.9954
        ],
        [
            0.994700000038147
        ],
        [
            0.99536
        ],
        [
            0.99522
        ],
        [
            0.9951
        ],
        [
            0.9953
        ],
        [
            0.9952600000190734
        ],
        [
            0.9955
        ],
        [
            0.99564
        ],
        [
            0.9959000000190735
        ],
        [
            0.99624
        ],
        [
            0.99596
        ],
        [
            0.99556
        ],
        [
            0.9959600000190735
        ],
        [
            0.99638
        ],
        [
            0.99658
        ],
        [
            0.9965
        ],
        [
            0.99684
        ],
        [
            0.99588
        ],
        [
            0.99618
        ],
        [
            0.99622
        ],
        [
            0.9966800000190735
        ],
        [
            0.9971
        ],
        [
            0.9963
        ],
        [
            0.99722
        ],
        [
            0.99718
        ],
        [
            0.99686
        ],
        [
            0.99674
        ],
        [
            0.99714
        ],
        [
            0.9974000000190735
        ],
        [
            0.99706
        ],
        [
            0.99728
        ],
        [
            0.9973
        ],
        [
            0.99704
        ],
        [
            0.99746
        ],
        [
            0.99746
        ],
        [
            0.99778
        ],
        [
            0.99712
        ],
        [
            0.9975000000190735
        ],
        [
            0.99796
        ],
        [
            0.99782
        ],
        [
            0.9977800000190735
        ],
        [
            0.99762
        ],
        [
            0.9978
        ],
        [
            0.9978
        ],
        [
            0.9975
        ],
        [
            0.99798
        ],
        [
            0.99802
        ],
        [
            0.99738
        ],
        [
            0.99816
        ],
        [
            0.9977
        ],
        [
            0.9975
        ],
        [
            0.99794
        ],
        [
            0.9983
        ],
        [
            0.99768
        ],
        [
            0.99812
        ],
        [
            0.9982400000190735
        ],
        [
            0.99838
        ],
        [
            0.9977600000190735
        ],
        [
            0.9984
        ],
        [
            0.99794
        ],
        [
            0.99822
        ],
        [
            0.99848
        ],
        [
            0.9983
        ],
        [
            0.99824
        ],
        [
            0.99792
        ],
        [
            0.99808
        ],
        [
            0.998
        ],
        [
            0.99854
        ],
        [
            0.9985
        ],
        [
            0.99844
        ],
        [
            0.99792
        ],
        [
            0.9984600000190735
        ],
        [
            0.99856
        ],
        [
            0.99844
        ],
        [
            0.99862
        ],
        [
            0.99822
        ],
        [
            0.99822
        ],
        [
            0.99846
        ],
        [
            0.99884
        ],
        [
            0.99854
        ],
        [
            0.99802
        ],
        [
            0.9982600000190734
        ],
        [
            0.9984600000190735
        ],
        [
            0.99874
        ],
        [
            0.99864
        ],
        [
            0.99862
        ],
        [
            0.99852
        ],
        [
            0.99866
        ],
        [
            0.99832
        ],
        [
            0.99868
        ],
        [
            0.99838
        ],
        [
            0.9987
        ],
        [
            0.99844
        ],
        [
            0.99872
        ],
        [
            0.99838
        ],
        [
            0.9987
        ],
        [
            0.99838
        ],
        [
            0.9985
        ],
        [
            0.99866
        ],
        [
            0.99872
        ],
        [
            0.99862
        ],
        [
            0.9987
        ],
        [
            0.99872
        ],
        [
            0.9985400000190735
        ],
        [
            0.9987600000190735
        ],
        [
            0.99882
        ],
        [
            0.99876
        ],
        [
            0.99882
        ],
        [
            0.99874
        ],
        [
            0.99862
        ],
        [
            0.99892
        ],
        [
            0.998760000038147
        ],
        [
            0.99904
        ],
        [
            0.99894
        ],
        [
            0.99896
        ],
        [
            0.99864
        ],
        [
            0.99888
        ],
        [
            0.9987
        ],
        [
            0.99904
        ],
        [
            0.99898
        ],
        [
            0.999
        ],
        [
            0.99882
        ],
        [
            0.99902
        ],
        [
            0.9986600000190735
        ],
        [
            0.9987200000190735
        ],
        [
            0.99862
        ],
        [
            0.99888
        ],
        [
            0.99892
        ],
        [
            0.99878
        ],
        [
            0.99888
        ],
        [
            0.9989800000190735
        ],
        [
            0.99852
        ],
        [
            0.99912
        ],
        [
            0.9989
        ],
        [
            0.999
        ],
        [
            0.99914
        ]
    ],
    "train_losses": [
        [
            1.8567809911346436
        ],
        [
            1.3488472664260864
        ],
        [
            1.1307868292617798
        ],
        [
            0.9852786320877075
        ],
        [
            0.8791480930137634
        ],
        [
            0.7837695654678345
        ],
        [
            0.7081934834098816
        ],
        [
            0.6466924634170532
        ],
        [
            0.5792777361488343
        ],
        [
            0.519273485660553
        ],
        [
            0.4641352813053131
        ],
        [
            0.4120397484397888
        ],
        [
            0.36614085834503174
        ],
        [
            0.3237093146800995
        ],
        [
            0.2798639963817596
        ],
        [
            0.24525354849815367
        ],
        [
            0.21688383062839509
        ],
        [
            0.18916050673484802
        ],
        [
            0.17192448389053344
        ],
        [
            0.15220932394027709
        ],
        [
            0.1323075634098053
        ],
        [
            0.12583232973098754
        ],
        [
            0.11185966429710388
        ],
        [
            0.10102702478647232
        ],
        [
            0.09351390807151795
        ],
        [
            0.08125330341339111
        ],
        [
            0.08040920057058334
        ],
        [
            0.07105347600102424
        ],
        [
            0.06388307719230651
        ],
        [
            0.06629440423488617
        ],
        [
            0.05622920621931553
        ],
        [
            0.05341889865875244
        ],
        [
            0.05269466951131821
        ],
        [
            0.04988411153554916
        ],
        [
            0.045869454013109205
        ],
        [
            0.04086243168830871
        ],
        [
            0.0406121735958755
        ],
        [
            0.03774562226831913
        ],
        [
            0.03749997945457697
        ],
        [
            0.03480281720399857
        ],
        [
            0.030562916355133057
        ],
        [
            0.032625853192210195
        ],
        [
            0.03326830480605364
        ],
        [
            0.028460433687120677
        ],
        [
            0.027154116728305817
        ],
        [
            0.026409741567373277
        ],
        [
            0.025584140646755696
        ],
        [
            0.024089174855351447
        ],
        [
            0.024856267521381377
        ],
        [
            0.02397903647273779
        ],
        [
            0.02226848445519805
        ],
        [
            0.024097196576148273
        ],
        [
            0.019758822184056044
        ],
        [
            0.01876205211311579
        ],
        [
            0.018974221892356872
        ],
        [
            0.019554157996773718
        ],
        [
            0.018742364858984947
        ],
        [
            0.018118941473215817
        ],
        [
            0.01809783070474863
        ],
        [
            0.0186828950715065
        ],
        [
            0.016159274014532567
        ],
        [
            0.014755162134170533
        ],
        [
            0.016117482440769673
        ],
        [
            0.013951574799790978
        ],
        [
            0.015606067390441895
        ],
        [
            0.01416185370400548
        ],
        [
            0.015067030049413442
        ],
        [
            0.014728502515777946
        ],
        [
            0.013374247986674309
        ],
        [
            0.01343180999904871
        ],
        [
            0.012717392065227031
        ],
        [
            0.01251546226516366
        ],
        [
            0.012781270814538002
        ],
        [
            0.011469934809720144
        ],
        [
            0.012404739556461573
        ],
        [
            0.013191181293725967
        ],
        [
            0.012380582547709346
        ],
        [
            0.011557825874201953
        ],
        [
            0.010657991507835687
        ],
        [
            0.010331123953387141
        ],
        [
            0.010098251349553465
        ],
        [
            0.011017179011404515
        ],
        [
            0.010930549125596881
        ],
        [
            0.011273295490406454
        ],
        [
            0.00974166148547083
        ],
        [
            0.009369955924749374
        ],
        [
            0.01126142740879208
        ],
        [
            0.008322677054144443
        ],
        [
            0.009693757298067212
        ],
        [
            0.009828299803212285
        ],
        [
            0.00960930006749928
        ],
        [
            0.008670026906877756
        ],
        [
            0.007473842013329268
        ],
        [
            0.00896651164405048
        ],
        [
            0.008242771419882774
        ],
        [
            0.00828572286458686
        ],
        [
            0.009139268311746418
        ],
        [
            0.007887009677421302
        ],
        [
            0.007583328188583255
        ],
        [
            0.007174476644024253
        ],
        [
            0.008912405110597611
        ],
        [
            0.00771698377314955
        ],
        [
            0.006956088786311447
        ],
        [
            0.0074744711761176585
        ],
        [
            0.007371142167896032
        ],
        [
            0.00755078680343926
        ],
        [
            0.007514420040398836
        ],
        [
            0.007457162243127823
        ],
        [
            0.007168336678687483
        ],
        [
            0.0058360462974570695
        ],
        [
            0.006307251842916012
        ],
        [
            0.007853887159228325
        ],
        [
            0.005947482232190668
        ],
        [
            0.00756152900274843
        ],
        [
            0.007671604059189558
        ],
        [
            0.006319559914059937
        ],
        [
            0.005515696528926492
        ],
        [
            0.006417707643546164
        ],
        [
            0.005943259456865489
        ],
        [
            0.005546002252101898
        ],
        [
            0.005272431582864374
        ],
        [
            0.00688464622285217
        ],
        [
            0.005401064305696636
        ],
        [
            0.006221285947465804
        ],
        [
            0.005072040285980329
        ],
        [
            0.0052249535581283275
        ],
        [
            0.005484906998747028
        ],
        [
            0.005503095311317593
        ],
        [
            0.0064351604330260305
        ],
        [
            0.006022881220765412
        ],
        [
            0.006306846868414432
        ],
        [
            0.00498745907750912
        ],
        [
            0.005189160511642694
        ],
        [
            0.005386723012244329
        ],
        [
            0.005705271272864193
        ],
        [
            0.005044994866363704
        ],
        [
            0.004886588455685415
        ],
        [
            0.004770621262136847
        ],
        [
            0.0049988016316154975
        ],
        [
            0.005362324787452817
        ],
        [
            0.00541621557481587
        ],
        [
            0.004718492889720947
        ],
        [
            0.004404257533494383
        ],
        [
            0.004644689750913531
        ],
        [
            0.005898199398797006
        ],
        [
            0.005157768011977896
        ],
        [
            0.004682990529090166
        ],
        [
            0.004140505256745964
        ],
        [
            0.004512044529393315
        ],
        [
            0.004241140574058518
        ],
        [
            0.004644972295323387
        ],
        [
            0.004107740519270301
        ],
        [
            0.005019985182811506
        ],
        [
            0.004212416799273342
        ],
        [
            0.00519952420595102
        ],
        [
            0.004284436074150726
        ],
        [
            0.004439649560563266
        ],
        [
            0.003636373389810324
        ],
        [
            0.005045378802153282
        ],
        [
            0.004026106261229142
        ],
        [
            0.004628283342849464
        ],
        [
            0.004482000597557053
        ],
        [
            0.004846542274542153
        ],
        [
            0.0039726359215565025
        ],
        [
            0.004818458651807159
        ],
        [
            0.003955828846953809
        ],
        [
            0.003702115326784551
        ],
        [
            0.004167727383766323
        ],
        [
            0.004052886519832537
        ],
        [
            0.003814582265019417
        ],
        [
            0.003503959449166432
        ],
        [
            0.0038550156214740127
        ],
        [
            0.00428426830245182
        ],
        [
            0.0038445100494101645
        ],
        [
            0.003464837498019915
        ],
        [
            0.0037708462645020336
        ],
        [
            0.003204260370163247
        ],
        [
            0.0032935153913032263
        ],
        [
            0.0035441335802990945
        ],
        [
            0.004566712821852416
        ],
        [
            0.0035156014130124824
        ],
        [
            0.00404539098603651
        ],
        [
            0.0028738833412528036
        ],
        [
            0.0035566272507980465
        ],
        [
            0.0035943901830445975
        ],
        [
            0.0033121302894782273
        ],
        [
            0.0033194440908078104
        ],
        [
            0.0038700676981871947
        ],
        [
            0.0035955160223133864
        ],
        [
            0.0037164896031841635
        ],
        [
            0.0033436383092263714
        ],
        [
            0.0033485304587334394
        ],
        [
            0.0035294196054246278
        ],
        [
            0.00337053464403376
        ],
        [
            0.003645918898009695
        ],
        [
            0.004446949575608596
        ],
        [
            0.0029920299315359445
        ],
        [
            0.0034686625180067494
        ],
        [
            0.003582805446833372
        ],
        [
            0.002660053882105276
        ]
    ],
    "val_accs": [
        [
            0.4886
        ],
        [
            0.5859
        ],
        [
            0.6401
        ],
        [
            0.6701
        ],
        [
            0.7028
        ],
        [
            0.7101
        ],
        [
            0.732
        ],
        [
            0.7423
        ],
        [
            0.7563
        ],
        [
            0.7576
        ],
        [
            0.7585
        ],
        [
            0.7509
        ],
        [
            0.7701
        ],
        [
            0.7687
        ],
        [
            0.7669
        ],
        [
            0.7694
        ],
        [
            0.7725
        ],
        [
            0.7711
        ],
        [
            0.7734
        ],
        [
            0.77
        ],
        [
            0.7683
        ],
        [
            0.7787
        ],
        [
            0.7709
        ],
        [
            0.7722
        ],
        [
            0.7754
        ],
        [
            0.7726
        ],
        [
            0.7774
        ],
        [
            0.7771
        ],
        [
            0.7773
        ],
        [
            0.779
        ],
        [
            0.7745
        ],
        [
            0.7761
        ],
        [
            0.777
        ],
        [
            0.776
        ],
        [
            0.7762
        ],
        [
            0.7776
        ],
        [
            0.7768
        ],
        [
            0.7794
        ],
        [
            0.7792
        ],
        [
            0.7793
        ],
        [
            0.7784
        ],
        [
            0.7784
        ],
        [
            0.781
        ],
        [
            0.7824
        ],
        [
            0.7784
        ],
        [
            0.7828
        ],
        [
            0.7816
        ],
        [
            0.7811
        ],
        [
            0.7829
        ],
        [
            0.779
        ],
        [
            0.7827
        ],
        [
            0.7806
        ],
        [
            0.782
        ],
        [
            0.7823
        ],
        [
            0.781
        ],
        [
            0.7844
        ],
        [
            0.7836
        ],
        [
            0.7854
        ],
        [
            0.7852
        ],
        [
            0.7874
        ],
        [
            0.7845
        ],
        [
            0.7847
        ],
        [
            0.7871
        ],
        [
            0.7853
        ],
        [
            0.7818
        ],
        [
            0.782
        ],
        [
            0.7836
        ],
        [
            0.7879
        ],
        [
            0.7871
        ],
        [
            0.7843
        ],
        [
            0.7844
        ],
        [
            0.7829
        ],
        [
            0.7861
        ],
        [
            0.7831
        ],
        [
            0.786
        ],
        [
            0.7857
        ],
        [
            0.7883
        ],
        [
            0.787
        ],
        [
            0.7854
        ],
        [
            0.7853
        ],
        [
            0.786
        ],
        [
            0.7849
        ],
        [
            0.7823
        ],
        [
            0.7851
        ],
        [
            0.7874
        ],
        [
            0.7856
        ],
        [
            0.7865
        ],
        [
            0.7879
        ],
        [
            0.7879
        ],
        [
            0.7876
        ],
        [
            0.7855
        ],
        [
            0.7845
        ],
        [
            0.7891
        ],
        [
            0.7867
        ],
        [
            0.7874
        ],
        [
            0.7878
        ],
        [
            0.7876
        ],
        [
            0.7884
        ],
        [
            0.7874
        ],
        [
            0.7894
        ],
        [
            0.7882
        ],
        [
            0.7888
        ],
        [
            0.7874
        ],
        [
            0.7873
        ],
        [
            0.7877
        ],
        [
            0.7907
        ],
        [
            0.7885
        ],
        [
            0.7845
        ],
        [
            0.7889
        ],
        [
            0.7854
        ],
        [
            0.7909
        ],
        [
            0.7899
        ],
        [
            0.79
        ],
        [
            0.7902
        ],
        [
            0.7894
        ],
        [
            0.7889
        ],
        [
            0.7901
        ],
        [
            0.7903
        ],
        [
            0.7889
        ],
        [
            0.7904
        ],
        [
            0.7899
        ],
        [
            0.7895
        ],
        [
            0.7901
        ],
        [
            0.7864
        ],
        [
            0.7876
        ],
        [
            0.7835
        ],
        [
            0.7856
        ],
        [
            0.7861
        ],
        [
            0.7869
        ],
        [
            0.785
        ],
        [
            0.788
        ],
        [
            0.7873
        ],
        [
            0.787
        ],
        [
            0.7878
        ],
        [
            0.7869
        ],
        [
            0.7886
        ],
        [
            0.7894
        ],
        [
            0.7853
        ],
        [
            0.7885
        ],
        [
            0.7874
        ],
        [
            0.7857
        ],
        [
            0.7883
        ],
        [
            0.7883
        ],
        [
            0.7884
        ],
        [
            0.79
        ],
        [
            0.788
        ],
        [
            0.7873
        ],
        [
            0.7865
        ],
        [
            0.7876
        ],
        [
            0.7877
        ],
        [
            0.7869
        ],
        [
            0.7871
        ],
        [
            0.7879
        ],
        [
            0.7896
        ],
        [
            0.7891
        ],
        [
            0.7886
        ],
        [
            0.7877
        ],
        [
            0.7842
        ],
        [
            0.7879
        ],
        [
            0.7861
        ],
        [
            0.789
        ],
        [
            0.7885
        ],
        [
            0.7879
        ],
        [
            0.7906
        ],
        [
            0.7905
        ],
        [
            0.7887
        ],
        [
            0.789
        ],
        [
            0.7897
        ],
        [
            0.7885
        ],
        [
            0.7893
        ],
        [
            0.7877
        ],
        [
            0.7882
        ],
        [
            0.7886
        ],
        [
            0.7888
        ],
        [
            0.7893
        ],
        [
            0.7903
        ],
        [
            0.7909
        ],
        [
            0.7903
        ],
        [
            0.7909
        ],
        [
            0.7891
        ],
        [
            0.7901
        ],
        [
            0.7897
        ],
        [
            0.7898
        ],
        [
            0.7871
        ],
        [
            0.7907
        ],
        [
            0.7911
        ],
        [
            0.7924
        ],
        [
            0.7889
        ],
        [
            0.7895
        ],
        [
            0.7895
        ],
        [
            0.7907
        ],
        [
            0.7914
        ],
        [
            0.7889
        ],
        [
            0.7893
        ],
        [
            0.7917
        ],
        [
            0.7896
        ],
        [
            0.7872
        ],
        [
            0.7896
        ],
        [
            0.7901
        ],
        [
            0.7908
        ]
    ],
    "val_losses": [
        [
            1.4374334159851074
        ],
        [
            1.1707500319480897
        ],
        [
            1.0178693658828735
        ],
        [
            0.9290931539535523
        ],
        [
            0.8452133539199829
        ],
        [
            0.8272171761512757
        ],
        [
            0.7642117376327515
        ],
        [
            0.7544403005599976
        ],
        [
            0.7126483615875244
        ],
        [
            0.7143302527427673
        ],
        [
            0.7254646820068359
        ],
        [
            0.7790986399650573
        ],
        [
            0.7105179708480835
        ],
        [
            0.7374266432762147
        ],
        [
            0.7794590909957886
        ],
        [
            0.7915664001464844
        ],
        [
            0.8214913298606873
        ],
        [
            0.895467897605896
        ],
        [
            0.8465748746871948
        ],
        [
            0.8888419268608093
        ],
        [
            0.9333744985580444
        ],
        [
            0.9392885776519775
        ],
        [
            0.9855655752182007
        ],
        [
            0.9970110304832458
        ],
        [
            0.9740798318862915
        ],
        [
            1.0471062143325807
        ],
        [
            1.072277786064148
        ],
        [
            1.0607736888885497
        ],
        [
            1.0458353063583374
        ],
        [
            1.0340008712768554
        ],
        [
            1.1357958263397216
        ],
        [
            1.127115605545044
        ],
        [
            1.1139319440841675
        ],
        [
            1.1522181182861329
        ],
        [
            1.1576841007232666
        ],
        [
            1.2006519992828368
        ],
        [
            1.1937815349578857
        ],
        [
            1.2276108860969543
        ],
        [
            1.1990205963134766
        ],
        [
            1.1875345943450928
        ],
        [
            1.2301606182098388
        ],
        [
            1.2086527313232422
        ],
        [
            1.1761243198394775
        ],
        [
            1.2380653299331665
        ],
        [
            1.2313090587615967
        ],
        [
            1.268005383682251
        ],
        [
            1.2666806831359863
        ],
        [
            1.2712339981079102
        ],
        [
            1.2552833269119263
        ],
        [
            1.2774782121658326
        ],
        [
            1.2419324214935303
        ],
        [
            1.2838279079437256
        ],
        [
            1.2716740684509278
        ],
        [
            1.2862336767196656
        ],
        [
            1.2817755340576171
        ],
        [
            1.291571919822693
        ],
        [
            1.2894088970184325
        ],
        [
            1.3085966690063477
        ],
        [
            1.2893707136154176
        ],
        [
            1.2848994386672974
        ],
        [
            1.2799922594070434
        ],
        [
            1.3126482568740845
        ],
        [
            1.319936032485962
        ],
        [
            1.3253983867645263
        ],
        [
            1.3521746282577514
        ],
        [
            1.3300923950195314
        ],
        [
            1.3135918796539308
        ],
        [
            1.3249065143585206
        ],
        [
            1.3448750492095947
        ],
        [
            1.32952947845459
        ],
        [
            1.3348642444610597
        ],
        [
            1.3315297624588012
        ],
        [
            1.3322108856201171
        ],
        [
            1.3626730045318602
        ],
        [
            1.356341361618042
        ],
        [
            1.3626950904846191
        ],
        [
            1.3284279003143311
        ],
        [
            1.3442073074340821
        ],
        [
            1.3627230529785157
        ],
        [
            1.3690302453994752
        ],
        [
            1.3677472267150879
        ],
        [
            1.354884987258911
        ],
        [
            1.388506063079834
        ],
        [
            1.355575989151001
        ],
        [
            1.365406307220459
        ],
        [
            1.3582698558807373
        ],
        [
            1.3496649341583251
        ],
        [
            1.3657683280944823
        ],
        [
            1.3713958736419678
        ],
        [
            1.3633464223861695
